celtix-rt/rt-test/src/test/java/org/objectweb/celtix/bus/bindings/soap/resources/TestHeader3DocLitReq.xml

<?xml version="1.0" encoding="utf-8" ?>
<SOAP-ENV:Envelope 
	xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" 
	xmlns:xs="http://www.w3.org/2001/XMLSchema"
	xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance"
	xmlns:ns4="http://objectweb.org/header_test/types">
	<SOAP-ENV:Header>
		<ns4:testHeader3 SOAP-ENV:mustUnderstand="true">
			<ns4:requestType xsi:nil="true"/>
		</ns4:testHeader3>
	</SOAP-ENV:Header>
	<SOAP-ENV:Body>
        <ns4:testHeader3>
				<ns4:requestType>BodyVal3</ns4:requestType>
		</ns4:testHeader3>
	</SOAP-ENV:Body>
</SOAP-ENV:Envelope>